////////////////////////////////
// 
// Input.h
// 
// 役割：入力を管理するクラス
// 
// 作成開始日：2025/12/29
// 
// 作成日：2025/
// 
// 
// 
// 
// 
////////////////////////////////

////////////////////----- 単語帳 -----////////////////////////////////////////////////////////////////////////////////
//
// 
// 
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#pragma once

class Input
{
public:
	// 初期化
	void Init();

	// 毎フレーム呼ぶ更新処理
	void Update();

	// --- キー入力判定関数 ---
	// keycode: VK_SPACE, 'A'等のキーコード

	// 押されている間ずっと true
	bool GetKey(int keycode);

	// 押された瞬間だけ true
	bool GetKyDown(int keycode);

	// 離された瞬間だけ true
	bool GetKeyUp(int keycord);

private:
	// キーボードのキー数（２５６個）
	static const int KEY_NUM = 256;

	// 現在のフレームのキー状態
	bool m_currentKeys[KEY_NUM];

	// 1フレーム前のキー状態（押された瞬間の判定に使う）
	bool m_prevKeys[KEY_NUM];


};
