///////////////////////////////////////////////////////////////////////////////////////////////////
// 
// MeshComponent.h
// 
// 役割：Entityの「形状（頂点データ）」を管理するデータ
// 
// 作成開始日：2025/12/16
// 
// 作成日：
// 作業内容：#1
//       追加：
// 　　　追加：
// 
// 
// 
// 
// 
// 
/////////////////////////////////////////////////////////////////////////////////////////////////////


////////////////////----- 単語帳 -----////////////////////////////
//
// ・
// 
// 
///////////////////////////////////////////////////////////////////

#pragma once
#include <vector>
#include "Graphics/DX11Device.h" // Vertex構造体の定義を使うためにインクルード

using namespace std;

struct MeshComponent
{
	/*頂点リスト
	　固定配列[]ではなく、std::vectorを使う理由：キャラクターによって頂点の数が違う（三角形なら3個、四角形なら6個...）ため
	  伸び縮みできる箱（vector）が必要だから*/
	vector<Vertex> vertices;


	// コンストラクタ
	// 最初は空っぽで作れるようにしておく
	MeshComponent() = default;

	// データを流し混みやすくするための便利コンストラクター
	MeshComponent(const vector<Vertex>& _vertices)
		:vertices(_vertices)
	{

	}
};
